package lesson04;

public class Homework02 {
    /*
    Задача: Создайте три переменные: две целочисленные переменные с любыми значениями и одну переменную для результата.
     Выполните суммирование первых двух переменных и сохраните результат в третьей переменной.
      Выведите результат на экран.
     */
    public static void main(String[] args) {
        int a = 4;
        int b = 6;
        int result = a + b;
        System.out.println("Result = " + result);

    }
}
