package lesson04;

public class Homework01 {
    /*
    Напишите программу, в которой вы объявите переменные для хранения вашего возраста,
     имени и является ли сегодня выходным (логическое значение). Инициализируйте эти переменные соответствующими значениями.
     */
    public static void main(String[] args) {
         byte age = 18;
         String name = "Maksym";
         boolean freeDay = false;
         System.out.println("Age: " + age + "\nName: " + name + "\nIs weekend today? - " + freeDay);

    }

}
